### .reindex .drop .iloc(无敌)
### 感觉是五一玩太多了，有些没有状态，就先少学一点⑧

# 基本功能

# 5.2.1 重建索引

In [2]:
import pandas as pd
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2
# reindex

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [4]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3
obj3.reindex(range(6),method='ffill')
# ffill方法会把值向前填充(0-->1)

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [5]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],# index为row
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [6]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [7]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [9]:
frame.loc[['a', 'b', 'c', 'd'], states]
# keyerror有未知数据报错，以前好像会一边报错一边输出，现在好像寄了

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Index(['b'], dtype='object'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

# 5.2.2 轴向上删除条目

In [11]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [13]:
new_obj = obj.drop(['d', 'c'])
new_obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [14]:
obj.drop(['a'])
# .drop进行删除

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [16]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [18]:
data.drop('two', axis=1)
# 必须要axis（y不变在x轴上看），否则会在行index找目标发现没有而报错

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [19]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [20]:
obj.drop('c', inplace=True)
obj
# inplace清除被删除的数据

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

# 5.2.3 索引，选择和过滤

In [21]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [22]:
obj['b']

1.0

In [23]:
obj[1]

1.0

In [25]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [26]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [28]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [29]:
data[:2] # row的方法

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [30]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [31]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# 5.2.3.1 使用loc和iloc选择数据

In [32]:
data.loc['Colorado', ['two', 'three']]
# .loc轴标签

two      5
three    6
Name: Colorado, dtype: int32

In [33]:
data.iloc[1:2, 1:3]
# .iloc整数标签，先行后列

          two  three
Colorado    5      6

In [34]:
data.iloc[2:3, [3, 0, 1]]
# 没：就变成一维了

      four  one  two
Utah    11    8    9

In [35]:
data.iloc[2:3]

      one  two  three  four
Utah    8    9     10    11

In [36]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

# 5.2.4 整数索引

In [37]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [40]:
ser[-1]
# index也是整数，电脑分不清就会报错

KeyError: -1

In [39]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [42]:
ser3 = pd.Series(np.arange(3.),[4, 5, 6])
ser3

4    0.0
5    1.0
6    2.0
dtype: float64

In [43]:
ser3[:1]

4    0.0
dtype: float64

In [44]:
ser3.loc[4:5]
# .loc左右都取

4    0.0
5    1.0
dtype: float64

In [45]:
ser3.iloc[:1]
# 强推iloc

4    0.0
dtype: float64